:PROPERTIES:
:ID:       436EB0B7-811E-4828-BBF7-4126517DD7C6
:END:
#+title: emacs

* Startup

** server-start

#+begin_src emacs-lisp
  (describe-function #'server-start)
#+end_src

#+RESULTS:
#+begin_example
server-start is an autoloaded interactive byte-code-function in
‘server.el’.

(server-start &optional LEAVE-DEAD INHIBIT-PROMPT)

Allow this Emacs process to be a server for client processes.
This starts a server communications subprocess through which client
"editors" can send your editing commands to this Emacs job.
To use the server, set up the program ‘emacsclient’ in the Emacs
distribution as your standard "editor".

Optional argument LEAVE-DEAD (interactively, a prefix arg) means just
kill any existing server communications subprocess.

If a server is already running, restart it.  If clients are
running, ask the user for confirmation first, unless optional
argument INHIBIT-PROMPT is non-nil.

To force-start a server, do M-x server-force-delete and then
M-x server-start.

To check from a Lisp program whether a server is running, use
the ‘server-process’ variable.

  Probably introduced at or before Emacs version 18.

#+end_example

* Help
** man

[[id:40282DAC-6B66-47A9-9884-06CCC930D29D][man]] should likely be extracted out of emacs.

That will need some output tweaking to render properly in the notebooks.
This function provides that cleanup.

#+begin_src emacs-lisp
  (describe-function #'man)
#+end_src

#+RESULTS:
#+begin_example
man is an autoloaded interactive byte-code-function in ‘man.el’.

(man MAN-ARGS)

Get a Un*x manual page and put it in a buffer.
This command is the top-level command in the man package.
It runs a Un*x command to retrieve and clean a manpage in the
background and places the results in a ‘Man-mode’ browsing
buffer.  The variable ‘Man-width’ defines the number of columns in
formatted manual pages.  The buffer is displayed immediately.
The variable ‘Man-notify-method’ defines how the buffer is displayed.
If a buffer already exists for this man page, it will be displayed
without running the man command.

For a manpage from a particular section, use either of the
following.  "cat(1)" is how cross-references appear and is
passed to man as "1 cat".

    cat(1)
    1 cat

To see manpages from all sections related to a subject, use an
"all pages" option (which might be "-a" if it’s not the
default), then step through with ‘Man-next-manpage’ (M-n) etc.
Add to ‘Man-switches’ to make this option permanent.

    -a chmod

An explicit filename can be given too.  Use -l if it might
otherwise look like a page name.

    /my/file/name.1.gz
    -l somefile.1

An "apropos" query with -k gives a buffer of matching page
names or descriptions.  The pattern argument is usually an
"grep -E" style regexp.

    -k pattern

Note that in some cases you will need to use C-q to quote the
SPC character in the above examples, because this command attempts
to auto-complete your input based on the installed manual pages.

If ‘default-directory’ is remote, and ‘Man-support-remote-systems’
is non-nil, this command formats the man page on the remote system.
A prefix argument reverses the value of ‘Man-support-remote-systems’
for the current invocation.

  Probably introduced at or before Emacs version 19.29.

#+end_example

* Environment Info

** user-emacs-directory

#+begin_src emacs-lisp
  (describe-variable 'user-emacs-directory)
#+end_src

#+RESULTS:
#+begin_example
user-emacs-directory is a variable defined in ‘subr.el’.

Its value is "~/.emacs.d/"

Directory beneath which additional per-user Emacs-specific files are placed.
Various programs in Emacs store information in this directory.
Note that this should end with a directory separator.
See also ‘locate-user-emacs-file’.

  Probably introduced at or before Emacs version 23.1.

#+end_example

* Point

** point

#+begin_src emacs-lisp
  (describe-function #'point)
#+end_src

#+RESULTS:
#+begin_example
point is a primitive-function in ‘C source code’.

(point)

Declared type: (function nil integer)

Return value of point, as an integer.
Beginning of buffer is position (point-min).

  Other relevant functions are documented in the buffer group.
  Probably introduced at or before Emacs version 17.
  This function does not change global state, including the match
    data.
  This function has a ‘byte-compile’ property ‘byte-compile-no-args’.
    See the manual for details.

#+end_example

#+begin_src emacs-lisp
  (point)
#+end_src

#+RESULTS:
: 2583

** point-min

#+begin_src emacs-lisp
  (describe-function #'point-min)
#+end_src

#+RESULTS:
#+begin_example
point-min is a primitive-function in ‘C source code’.

(point-min)

Declared type: (function nil integer)

Return the minimum permissible value of point in the current buffer.
This is 1, unless narrowing (a buffer restriction) is in effect.

  Other relevant functions are documented in the buffer group.
  Probably introduced at or before Emacs version 17.
  This function does not change global state, including the match
    data.
  This function has a ‘byte-compile’ property ‘byte-compile-no-args’.
    See the manual for details.

#+end_example

#+begin_src emacs-lisp
  (point-min)
#+end_src

#+RESULTS:
: 1

* Buffers

** Summary

#+begin_src emacs-lisp :results value
  (save-excursion
    (shortdoc 'buffer)
    (buffer-substring-no-properties (point-min) (point-max)))
#+end_src

#+RESULTS:
#+begin_example
Buffer Basics

(current-buffer)
  Return the current buffer as a Lisp object.
  (current-buffer)
    e.g. ⇒ #<buffer shortdoc.el>


(bufferp object)
  Return t if OBJECT is an editor buffer.
  (bufferp 23)
    ⇒ nil


(buffer-live-p object)
  Return t if OBJECT is a buffer which has not been killed.
  (buffer-live-p some-buffer)
    e.g. ⇒ t


(buffer-modified-p &optional buffer)
  Return non-nil if BUFFER was modified since its file was last read or saved.
  (buffer-modified-p (current-buffer))
    ⇒ t


(buffer-name &optional buffer)
  Return the name of BUFFER, as a string.
  (buffer-name)
    ⇒ "*Shortdoc buffer*"


(window-buffer &optional window)
  Return the buffer displayed in window WINDOW.
  (window-buffer)
    ⇒ #<buffer 20260616070446-emacs.org>

Selecting Buffers

(get-buffer-create buffer-or-name &optional inhibit-buffer-hooks)
  Return the buffer specified by BUFFER-OR-NAME, creating a new one if needed.
  (get-buffer-create "*foo*")
    e.g. ⇒ #<buffer *foo*>


(pop-to-buffer buffer-or-name &optional action norecord)
  Display buffer specified by BUFFER-OR-NAME and select its window.
  (pop-to-buffer "*foo*")
    e.g. ⇒ #<buffer *foo*>


(with-current-buffer buffer-or-name &rest body)
  Execute the forms in BODY with BUFFER-OR-NAME temporarily current.
  (with-current-buffer buffer (buffer-size))
    → [it depends]

Points and Positions

(point)
  Return value of point, as an integer.
  (point)
    ⇒ 1441


(point-min)
  Return the minimum permissible value of point in the current buffer.
  (point-min)
    ⇒ 1


(point-max)
  Return the maximum permissible value of point in the current buffer.
  (point-max)
    ⇒ 1658


(pos-bol &optional n)
  Return the position of the first character on the current line.
  (pos-bol)
    ⇒ 1753


(pos-eol &optional n)
  Return the position of the last character on the current line.
  (pos-eol)
    ⇒ 1871


(bolp)
  Return t if point is at the beginning of a line.
  (bolp)
    ⇒ nil


(eolp)
  Return t if point is at the end of a line.
  (eolp)
    ⇒ t


(line-beginning-position &optional n)
  Return the position of the first character in the current line/field.
  (line-beginning-position)
    ⇒ 2166


(line-end-position &optional n)
  Return the position of the last character in the current line/field.
  (line-end-position)
    ⇒ 2310


(buffer-size &optional buffer)
  Return the number of characters in the current buffer.
  (buffer-size)
    ⇒ 2421


(bobp)
  Return t if point is at the beginning of the buffer.
  (bobp)
    ⇒ nil


(eobp)
  Return t if point is at the end of the buffer.
  (eobp)
    ⇒ t

Moving Around

(goto-char position)
  Set point to POSITION, a number or marker.
  (goto-char (point-max))
    e.g. ⇒ 342


(search-forward string &optional bound noerror count)
  Search forward from point for STRING.
  (search-forward "some-string" nil t)
    e.g. ⇒ 245


(re-search-forward regexp &optional bound noerror count)
  Search forward from point for regular expression REGEXP.
  (re-search-forward "some-s.*g" nil t)
    e.g. ⇒ 245


(forward-line &optional n)
  Move N lines forward (backward if N is negative).
  (forward-line 1)
    e.g. ⇒ 0
  (forward-line -2)
    e.g. ⇒ 0

Strings from Buffers

(buffer-string)
  Return the contents of the current buffer as a string.
  (buffer-string)
    → [it depends]


(buffer-substring start end)
  Return the contents of part of the current buffer as a string.
  (buffer-substring (point-min) (+ (point-min) 10))
    ⇒ #("Buffer Bas" 0 10 (face shortdoc-heading shortdoc-section t outline-level 1))


(buffer-substring-no-properties start end)
  Return the characters of part of the buffer, without the text properties.
  (buffer-substring-no-properties (point-min) (+ (point-min) 10))
    ⇒ "Buffer Bas"


(following-char)
  Return the character following point, as a number.
  (following-char)
    e.g. ⇒ 67


(preceding-char)
  Return the character preceding point, as a number.
  (preceding-char)
    e.g. ⇒ 38


(char-after &optional pos)
  Return character in current buffer at position POS.
  (char-after 45)
    ⇒ 32


(char-before &optional pos)
  Return character in current buffer preceding position POS.
  (char-before 13)
    ⇒ 99


(get-byte &optional position string)
  Return a byte value of a character at point.
  (get-byte 45)
    e.g. ⇒ #xff

Altering Buffers

(delete-region start end)
  Delete the text between START and END.
  (delete-region (point-min) (point-max))


(erase-buffer)
  Delete the entire contents of the current buffer.
  (erase-buffer)


(delete-line)
  Delete the current line.
  (delete-line)


(insert &rest args)
  Insert the arguments, either strings or characters, at point.
  (insert "This string will be inserted in the buffer\n")


(subst-char-in-region start end fromchar tochar &optional noundo)
  From START to END, replace FROMCHAR with TOCHAR each time it occurs.
  (subst-char-in-region (point-min) (point-max) ?+ ?-)


(replace-string-in-region string replacement &optional start end)
  Replace STRING with REPLACEMENT in the region from START to END.
  (replace-string-in-region "foo" "bar")

Locking

(lock-buffer &optional file)
  Lock FILE, if current buffer is modified.
  (lock-buffer "/tmp/foo")


(unlock-buffer)
  Unlock the file visited in the current buffer.
  (unlock-buffer)
#+end_example

** ->string

[[id:F2F61FB6-88DE-4275-B318-3B42CA58D65D][cl-defmethod]]

#+begin_src emacs-lisp
  (cl-defmethod ->string (ctx (obj buffer))
    (with-current-buffer obj
      (buffer-substring-no-properties (point-min) (point-max))))
#+end_src

#+RESULTS:
: ->string

** buffer-string

#+begin_src emacs-lisp
  (describe-function #'buffer-string)
#+end_src

#+RESULTS:
#+begin_example
buffer-string is a primitive-function in ‘src/editfns.c’.

(buffer-string)

Declared type: (function nil string)

Return the contents of the current buffer as a string.
If narrowing is in effect, this function returns only the visible part
of the buffer.

This function copies the text properties of that part of the buffer
into the result string; if you don’t want the text properties,
use ‘buffer-substring-no-properties’ instead.

  Other relevant functions are documented in the buffer group.
  Probably introduced at or before Emacs version 20.1.
  This function does not change global state, including the match data.

#+end_example

** buffer-substring-no-properties

#+begin_src emacs-lisp
  (describe-function #'buffer-substring-no-properties)
#+end_src

#+RESULTS:
#+begin_example
buffer-substring-no-properties is a primitive-function in
‘src/editfns.c’.

(buffer-substring-no-properties START END)

Return the characters of part of the buffer, without the text properties.
The two arguments START and END are character positions;
they can be in either order.

  Other relevant functions are documented in the buffer group.
  Probably introduced at or before Emacs version 19.29.
  This function does not change global state, including the match data.

#+end_example

** display-buffer

#+begin_src emacs-lisp
  (describe-function #'display-buffer)
#+end_src

#+RESULTS:
#+begin_example
display-buffer is an interactive byte-code-function in ‘window.el’.

It is bound to C-x 4 C-o.

(display-buffer BUFFER-OR-NAME &optional ACTION FRAME)

Display BUFFER-OR-NAME in some window, without selecting it.
To change which window is used, set ‘display-buffer-alist’
to an expression containing one of these "action" functions:

 ‘display-buffer-same-window’ -- Use the selected window.
 ‘display-buffer-reuse-window’ -- Use a window already showing the buffer.
 ‘display-buffer-in-previous-window’ -- Use a window that has previously
    displayed the buffer.
 ‘display-buffer-reuse-mode-window’ -- Use a window currently showing a
    buffer with the required major mode.
 ‘display-buffer-use-some-window’ -- Use some existing window.
 ‘display-buffer-use-least-recent-window’ -- Try to avoid reusing windows
    that have recently been switched to.
 ‘display-buffer-pop-up-window’ -- Pop up a new window.
 ‘display-buffer-pop-up-frame’ -- Use a new frame.
 ‘display-buffer-full-frame’ -- Delete other windows and use the full frame.
 ‘display-buffer-use-some-frame’ -- Use a frame meeting a predicate.
 ‘display-buffer-in-child-frame’ -- Use a child frame of the selected frame.
 ‘display-buffer-in-side-window’ -- Use a side window of the selected frame.
 ‘display-buffer-in-atom-window’ -- Use an atomic window.
 ‘display-buffer-below-selected’ -- Use or pop up a window below the
    selected one.
 ‘display-buffer-at-bottom’ -- Use or pop up a window at the bottom of the
    selected frame.
 ‘display-buffer-in-direction’ -- Use a window in a specified direction.
 ‘display-buffer-in-tab’ -- Use an appropriate existing tab or a new tab.
 ‘display-buffer-in-new-tab’ -- Use a new tab.
 ‘display-buffer-no-window’ -- Do not display the buffer and
    have ‘display-buffer’ return nil immediately.

For instance:

   (setq display-buffer-alist '((".*" display-buffer-at-bottom)))

Buffer display can be further customized to a very high degree;
the rest of this docstring explains some of the many
possibilities, and also see Info node ‘(emacs)Window Choice’ for
more information.

BUFFER-OR-NAME must be a buffer or a string naming a live buffer.
Return the window chosen for displaying that buffer, or nil if no
such window is found.

Optional argument ACTION, if non-nil, should specify a buffer
display action of the form (FUNCTIONS . ALIST).  FUNCTIONS is
either an "action function" or a possibly empty list of action
functions.  ALIST is a possibly empty "action alist".

An action function is a function that accepts two arguments: the
buffer to display and an action alist.  Based on those arguments,
it should try to display the buffer in a window and return that
window.  An action alist is an association list mapping symbols
to values.  Action functions use the action alist passed to them
to fine-tune their behaviors.

‘display-buffer’ builds a list of action functions and an action
alist by combining any action functions and alists specified by
‘display-buffer-overriding-action’, ‘display-buffer-alist’, the
ACTION argument, ‘display-buffer-base-action’, and
‘display-buffer-fallback-action’ (in order).  Then it calls each
function in the combined function list in turn, passing the
buffer as the first argument and the combined action alist as the
second argument, until one of the functions returns non-nil.

See above for the action functions and the action they try to
perform.

Action alist entries are:
 ‘inhibit-same-window’ -- A non-nil value prevents the same
    window from being used for display.
 \+‘previous-window’ -- The value specifies a window which may
    have previously displayed the buffer, and that should be
    preferred for displaying the buffer.
 ‘mode’ -- A major mode or a list of modes; ‘display-buffer’ may
    reuse a window if its current buffer is under one of those modes.
 ‘inhibit-switch-frame’ -- A non-nil value prevents any frame
    used for showing the buffer from being raised or selected.
    Note that a window manager may still raise a new frame and
    give it focus, effectively overriding the value specified
    here.
 ‘frame-predicate’ -- The value should be a function of one argument,
    a frame, and should return non-nil if the frame is a candidate
    for displaying the buffer.
 ‘reusable-frames’ -- The value specifies the set of frames to
    search for a window that already displays the buffer.
    Possible values are nil (the selected frame), t (any live
    frame), visible (any visible frame), 0 (any visible or
    iconified frame) or an existing live frame.
 \+‘pop-up-frames’ -- Same effect as the eponymous variable.
    Takes precedence over the variable.
 ‘pop-up-frame-parameters’ -- The value specifies an alist of
    frame parameters to give a new frame, if one is created.
 ‘parent-frame’ -- The value specifies the parent frame to be used
    when the buffer is displayed on a child frame.
 ‘child-frame-parameters’ -- The value specifies an alist of frame
    parameters to use when displaying a buffer on a child frame.
 \+‘window-height’ -- The value specifies the desired height of the
    window chosen and is either an integer (the total height of
    the window specified in frame lines), a floating point
    number (the fraction of its total height with respect to the
    total height of the frame’s root window), a cons cell whose
    car is ‘body-lines’ and whose cdr is an integer that
    specifies the height of the window’s body in frame lines, or
    a function to be called with one argument - the chosen
    window.  That function is supposed to adjust the height of
    the window.  Suitable functions are ‘fit-window-to-buffer’
    and ‘shrink-window-if-larger-than-buffer’.
 \+‘window-width’ -- The value specifies the desired width of the
    window chosen and is either an integer (the total width of
    the window specified in frame lines), a floating point
    number (the fraction of its total width with respect to the
    width of the frame’s root window), a cons cell whose car is
    ‘body-columns’ and whose cdr is an integer that specifies the
    width of the window’s body in frame columns, or a function to
    be called with one argument - the chosen window.  That
    function is supposed to adjust the width of the window.
 \+‘window-size’ -- This entry is only useful for windows appearing
    alone on their frame and specifies the desired size of that
    window either as a cons of integers (the total width and
    height of the window on that frame), a cons cell whose car is
    ‘body-chars’ and whose cdr is a cons of integers (the desired
    width and height of the window’s body in columns and lines of
    its frame), or a function to be called with one argument -
    the chosen window.  That function is supposed to adjust the
    size of the frame.
 \+‘window-min-width’ -- The minimum width of the window to be
    used, in canonical frame columns.  The value could also be
    the symbol ‘full-width’, which means the window to be used should
    be a full-width window on its frame.
 \+‘window-min-height’ -- The minimum height of the window to be
    used, in frame’s canonical lines.  The value could also be the
    symbol ‘full-height’, which means the window to be used should
    be a full-height window on its frame.
 ‘preserve-size’ -- The value should be either (t . nil) to
    preserve the width of the chosen window, (nil . t) to
    preserve its height or (t . t) to preserve its height and
    width in future changes of the window configuration.
 \+‘window-parameters’ -- The value specifies an alist of window
    parameters to give the chosen window.
 ‘dedicated’ -- If the value is non-nil, ‘display-buffer’ will make
    the window it uses dedicated (see ‘set-window-dedicated-p’) to the
    buffer.
 ‘lru-frames’ -- The value specifies the set of frames to search for
    a window that can be used to display the buffer.
 ‘lru-time’ -- The value specifies the maximum window use time (see
    ‘window-use-time’) to consider a window as a candidate for
    displaying the buffer.
 ‘bump-use-time’ -- A non-nil value means bump the use time of the
    window to use (see ‘window-bump-use-time’).
 ‘side’ -- The value specifies the side of a frame where to create a
    new window displaying the buffer.  See ‘display-buffer-in-side-window’.
 ‘slot’ -- If non-nil, specifies the side-window slot where to display
    the buffer, see ‘display-buffer-in-side-window’.
 \+‘window’ -- The value specifies the window related to the window
    to be used for displaying the buffer.
 ‘direction’ -- Together with a ‘window’ entry, the value determines
    the location of the window (see ‘display-buffer-in-direction’) to
    display the buffer.
 ‘allow-no-window’ -- A non-nil value means that ‘display-buffer’
    may not display the buffer and return nil immediately.
 \+‘some-window’ -- This entry defines which window
    ‘display-buffer-use-some-window’ should choose.  The possible choices
    are ‘lru’ or nil (the default) to select the least recently used window,
    and ‘mru’ to select the most recently used window.  It can also be a
    function that takes two arguments: a buffer and an alist, and should
    return the window in which to display the buffer.  If the value is
    ‘lru’, it avoids selecting windows that are not full-width and windows
    on another frame.  If the value is ‘mru’, it does not consider the
    selected window and windows on any frame but the selected one.  It’s
    useful to customize ‘display-buffer-base-action’ to
    ‘(nil . ((some-window . mru)))’ when you want to display buffers in the
    same non-selected window in a configuration with more than two windows.
 ‘body-function’ -- A function called with one argument - the
    displayed window.  It is called after the buffer is
    displayed, and before ‘window-height’, ‘window-width’
    and ‘preserve-size’ are applied.  The function is supposed
    to fill the window body with some contents that might depend
    on dimensions of the displayed window.
 ‘post-command-select-window’ -- A non-nil value means that after the
    current command is executed and the hook ‘post-command-hook’ is called,
    the window displayed by this function will be selected.  A nil value
    means that if functions like ‘pop-to-buffer’ selected another window,
    at the end of this command that window will be deselected, and the
    window that was selected before calling this function will remain
    selected regardless of which windows were selected afterwards within
    this command.
 ‘category’ -- If the caller of ‘display-buffer’ passes an alist entry
    ‘(category . symbol)’ in its action argument, then you can match
    the displayed buffer by using the same category in the condition
    part of ‘display-buffer-alist’ entries.
 ‘tab-name’ -- If non-nil, specifies the name of the tab in which to
    display the buffer; see ‘display-buffer-in-new-tab’.
 \+‘tab-group’ -- If non-nil, specifies the tab group to use when creating
    a new tab; see ‘display-buffer-in-new-tab’.

The entries ‘window-height’, ‘window-width’, ‘window-size’ and
‘preserve-size’ are applied only when the window used for
displaying the buffer never showed another buffer before.

The ACTION argument can also have a non-nil and non-list value.
This means to display the buffer in a window other than the
selected one, even if it is already displayed in the selected
window.  If called interactively with a prefix argument, ACTION
is t.  Non-interactive calls should always supply a list or nil.

The optional third argument FRAME, if non-nil, acts like a
(reusable-frames . FRAME) entry appended to the action alist
specified by the ACTION argument.

  Probably introduced at or before Emacs version 17.

#+end_example

** display-buffer-alist

#+begin_src emacs-lisp
  (describe-variable 'display-buffer-alist)
#+end_src

#+RESULTS:
#+begin_example
display-buffer-alist is a variable defined in ‘window.el’.

Its value is ((".*" display-buffer-same-window))
Original value was nil

Alist of user-defined conditional actions for ‘display-buffer’.
Its value takes effect before processing the ACTION argument of
‘display-buffer’ and before ‘display-buffer-base-action’ and
‘display-buffer-fallback-action’, but after
‘display-buffer-overriding-action’, which see.

If non-nil, this is an alist of elements (CONDITION . ACTION),
where:

 CONDITION is passed to ‘buffer-match-p’, along with the name of
  the buffer that is to be displayed and the ACTION argument of
  ‘display-buffer’, to check if ACTION should be used.

 ACTION is a cons cell (FUNCTIONS . ALIST), where FUNCTIONS is an
  action function or a list of action functions and ALIST is an
  action alist.  Each such action function should accept two
  arguments: a buffer to display and an alist of the same form as
  ALIST.  See ‘display-buffer’ for details.

‘display-buffer’ scans this alist until the CONDITION is satisfied
and adds the associated ACTION to the list of actions it will try.

  This variable may be risky if used as a file-local variable.
  This variable was introduced, or its default value was changed, in
  version 24.1 of Emacs.
  You can customize this variable.

#+end_example

*** Prefer Same Window

#+begin_src emacs-lisp
   (setq display-buffer-alist '((".*" display-buffer-same-window)))
#+end_src

#+RESULTS:
| .* | display-buffer-same-window |

** get-buffer-window

#+begin_src emacs-lisp
  (describe-function #'get-buffer-window)
#+end_src

#+RESULTS:
#+begin_example
get-buffer-window is a primitive-function in ‘C source code’.

(get-buffer-window &optional BUFFER-OR-NAME ALL-FRAMES)

Declared type:
  (function (&optional (or buffer string) (or symbol (integer 0 0)))
	    (or null window))

Return a window currently displaying BUFFER-OR-NAME, or nil if none.
BUFFER-OR-NAME may be a buffer or a buffer name and defaults to
the current buffer.

The optional argument ALL-FRAMES specifies the frames to consider:

- t means consider all windows on all existing frames.

- ‘visible’ means consider all windows on all visible frames.

- 0 (the number zero) means consider all windows on all visible
    and iconified frames.

- A frame means consider all windows on that frame only.

Any other value of ALL-FRAMES means consider all windows on the
selected frame and no others.

  Probably introduced at or before Emacs version 19.14.
  This function does not change global state, including the match data.

#+end_example

** help-buffer
#+begin_src emacs-lisp
  (describe-function #'help-buffer)
#+end_src

#+RESULTS:
#+begin_example
help-buffer is an autoloaded byte-code-function in ‘help-mode.el’.

(help-buffer)

Return the name of a buffer for inserting help.
If ‘help-xref-following’ is non-nil and the current buffer is
derived from ‘help-mode’, this is the name of the current buffer.

Otherwise, return "*Help*", creating a buffer with that name if
it does not already exist.

#+end_example

** save-current-buffer

#+begin_src emacs-lisp
  (describe-function #'save-current-buffer)
#+end_src

#+RESULTS:
#+begin_example
save-current-buffer is a special-form in ‘C source code’.

(save-current-buffer &rest BODY)

Record which buffer is current; execute BODY; make that buffer current.
BODY is executed just like ‘progn’.

  Probably introduced at or before Emacs version 20.1.
  This function has a ‘byte-compile’ property
    ‘byte-compile-save-current-buffer’.  See the manual for details.

#+end_example

** save-some-buffers

#+begin_src emacs-lisp
  (describe-function #'save-some-buffers)
#+end_src

#+RESULTS:
#+begin_example
save-some-buffers is an interactive byte-code-function in ‘files.el’.

It is bound to C-x s.

(save-some-buffers &optional ARG PRED)

Save some modified file-visiting buffers.  Asks user about each one.
You can answer y or SPC to save, n or DEL not to save, C-r
to look at the buffer in question with ‘view-buffer’ before
deciding, d to view the differences using
‘diff-buffer-with-file’, ! to save the buffer and all remaining
buffers without any further querying, . to save only the
current buffer and skip the remaining ones and q or RET to exit
the function without saving any more buffers.  C-h displays a
help message describing these options.

This command first saves any buffers where ‘buffer-save-without-query’ is
non-nil, without asking.

Optional argument ARG (interactively, prefix argument) non-nil means save
all with no questions.
Optional second argument PRED determines which buffers are considered:
If PRED is nil, all the file-visiting buffers are considered.
If PRED is t, then certain non-file buffers will also be considered.
If PRED is a function, it is called with no argument in each buffer and
should return non-nil if that buffer should be considered.
PRED defaults to the value of ‘save-some-buffers-default-predicate’.

See ‘save-some-buffers-action-alist’ if you want to
change the additional actions you can take on files.

The functions in ‘save-some-buffers-functions’ will be called
after saving the buffers.

  Probably introduced at or before Emacs version 19.20.

#+end_example

** switch-to-prev-buffer-skip
:PROPERTIES:
:ID:       B11A5ECF-B961-4722-885E-B9965938E615
:END:

#+begin_src emacs-lisp
  (describe-variable 'switch-to-prev-buffer-skip)
#+end_src

#+RESULTS:
#+begin_example
switch-to-prev-buffer-skip is a variable defined in ‘window.el’.

Its value is
#f(lambda (window buffer bury-or-kill) :dynbind
    (with-current-buffer buffer (org-roam-node-p)))
Original value was nil

Buffers ‘switch-to-prev-buffer’ should skip.
If this variable is nil, ‘switch-to-prev-buffer’ may switch to
any buffer, including those already shown in other windows.

If this variable is non-nil, ‘switch-to-prev-buffer’ will refrain
from switching to certain buffers according to the value of this
variable:

- ‘this’ means do not switch to a buffer shown on the frame that
  hosts the window ‘switch-to-prev-buffer’ is acting upon.

- ‘visible’ means do not switch to a buffer shown on any visible
  frame.

- 0 (the number zero) means do not switch to a buffer shown on
  any visible or iconified frame.

- t means do not switch to a buffer shown on any live frame.

If this option specifies a function, that function is called with
three arguments - the WINDOW argument of ‘switch-to-prev-buffer’,
a buffer ‘switch-to-prev-buffer’ intends to switch to and the
BURY-OR-KILL argument of ‘switch-to-prev-buffer’.  If that
function returns non-nil, ‘switch-to-prev-buffer’ will not switch
to that buffer.

Since ‘switch-to-prev-buffer’ is called by ‘bury-buffer’,
‘replace-buffer-in-windows’ and ‘quit-restore-window’ among
others, customizing this option may also affect the behavior of
Emacs when a window is quit or a buffer gets buried or killed.

The value of this option is consulted by ‘switch-to-next-buffer’
as well.  In that case, if this option specifies a function, it
will be called with the third argument nil.

Under certain circumstances ‘switch-to-prev-buffer’ may ignore
this option, for example, when there is only one buffer left.

Also see ‘switch-to-prev-buffer-skip-regexp’.

  This variable was introduced, or its default value was changed, in
  version 27.1 of Emacs.
  You can customize this variable.

#+end_example

** switch-to-prev-buffer-skip-regexp

#+begin_src emacs-lisp
  (describe-variable 'switch-to-prev-buffer-skip-regexp)
#+end_src

#+RESULTS:
#+begin_example
switch-to-prev-buffer-skip-regexp is a variable defined in ‘window.el’.

Its value is nil

Buffers that ‘switch-to-prev-buffer’ and ‘switch-to-next-buffer’ should skip.
The value can either be a regexp or a list of regexps.  Buffers whose
names match these regexps are skipped by ‘switch-to-prev-buffer’
and ‘switch-to-next-buffer’, unless there’s no other buffer to
switch to.

Also see ‘switch-to-prev-buffer-skip’.

  This variable was introduced, or its default value was changed, in
  version 29.1 of Emacs.
  You can customize this variable.

#+end_example

** with-current-buffer
:PROPERTIES:
:ID:       9A9596F0-8138-47F1-8002-91B0474FE107
:END:

#+begin_src emacs-lisp
  (describe-function #'with-current-buffer)
#+end_src

#+RESULTS:
#+begin_example
with-current-buffer is a Lisp macro in ‘subr.el’.

(with-current-buffer BUFFER-OR-NAME &rest BODY)

Execute the forms in BODY with BUFFER-OR-NAME temporarily current.
BUFFER-OR-NAME must be a buffer or the name of an existing buffer.
The value returned is the value of the last form in BODY.  See
also ‘with-temp-buffer’.

  Other relevant functions are documented in the buffer group.
  Probably introduced at or before Emacs version 20.1.

#+end_example

** with-temp-buffer

#+begin_src emacs-lisp
  (describe-function #'with-temp-buffer)
#+end_src

#+RESULTS:
#+begin_example
with-temp-buffer is a Lisp macro in ‘subr.el’.

(with-temp-buffer &rest BODY)

Create a temporary buffer, and evaluate BODY there like ‘progn’.
The buffer does not run the hooks ‘kill-buffer-hook’,
‘kill-buffer-query-functions’, and ‘buffer-list-update-hook’.
See also ‘with-temp-file’ and ‘with-output-to-string’.

  Probably introduced at or before Emacs version 20.1.

#+end_example

* Clearing out definitions

** makunbound

#+begin_src emacs-lisp
  (describe-function #'makunbound)
#+end_src

#+RESULTS:
#+begin_example
makunbound is a primitive-function in ‘C source code’.

(makunbound SYMBOL)

Empty out the value cell of SYMBOL, making it void as a variable.
Return SYMBOL.

If a variable is void, trying to evaluate the variable signals a
‘void-variable’ error, instead of returning a value.  For more
details, see Info node ‘(elisp) Void Variables’.

See also ‘fmakunbound’.

#+end_example

** fmakunbound

#+begin_src emacs-lisp
  (describe-function #'fmakunbound)
#+end_src

#+RESULTS:
#+begin_example
fmakunbound is a primitive-function in ‘C source code’.

(fmakunbound SYMBOL)

Make SYMBOL’s function definition be nil.
Return SYMBOL.

If a function definition is nil, trying to call a function by
that name will cause a ‘void-function’ error.  For more details, see
Info node ‘(elisp) Function Cells’.

See also ‘makunbound’.

#+end_example

* Compilation

** byte-force-recompile

#+begin_src emacs-lisp
  (describe-function #'byte-force-recompile)
#+end_src

#+RESULTS:
#+begin_example
byte-force-recompile is an autoloaded interactive byte-code-function
in ‘bytecomp.el’.

(byte-force-recompile DIRECTORY)

Recompile every ‘.el’ file in DIRECTORY that already has a ‘.elc’ file.
Files in subdirectories of DIRECTORY are processed also.

  Probably introduced at or before Emacs version 19.30.

#+end_example

* Packages

** package-delete

#+begin_src emacs-lisp
  (describe-function #'package-delete)
#+end_src

#+RESULTS:
#+begin_example
package-delete is an interactive byte-code-function in ‘package.el’.

(package-delete PKG-DESC &optional FORCE NOSAVE)

Delete package PKG-DESC.

Argument PKG-DESC is the full description of the package, for example as
obtained by ‘package-get-descriptor’.  Interactively, prompt the user
for the package name and version.

When package is used elsewhere as dependency of another package,
refuse deleting it and return an error.
If prefix argument FORCE is non-nil, package will be deleted even
if it is used elsewhere.
If NOSAVE is non-nil, the package is not removed from
‘package-selected-packages’.

  Probably introduced at or before Emacs version 25.1.

#+end_example

** package-get-descriptor

#+begin_src emacs-lisp
  (describe-function #'package-get-descriptor)
#+end_src

#+RESULTS:
: package-get-descriptor is a byte-code-function in ‘package.el’.
: 
: (package-get-descriptor PKG-NAME)
: 
: Return the ‘package-desc’ of PKG-NAME.
: 

** package-list-packages

#+begin_src emacs-lisp
  (describe-function #'package-list-packages)
#+end_src

#+RESULTS:
#+begin_example
package-list-packages is an alias for ‘list-packages’ in ‘package.el’.

It can be invoked from the menu: Options → Manage Emacs Packages

(package-list-packages &optional NO-FETCH)

Display a list of packages.
This first fetches the updated list of packages before
displaying, unless a prefix argument NO-FETCH is specified.
The list is displayed in a buffer named ‘*Packages*’, and
includes the package’s version, availability status, and a
short description.

#+end_example

** package-upgrade-all

#+begin_src emacs-lisp
  (describe-function #'package-upgrade-all)
#+end_src

#+RESULTS:
#+begin_example
package-upgrade-all is an autoloaded interactive byte-code-function in
‘package.el’.

(package-upgrade-all &optional QUERY)

Refresh package list and upgrade all packages.
If QUERY, ask the user before upgrading packages.  When called
interactively, QUERY is always true.

Currently, packages which are part of the Emacs distribution are
not upgraded by this command.  To enable upgrading such a package
using this command, first upgrade the package to a newer version
from ELPA by either using ‘M-x package-upgrade’ or
‘i’ after ‘M-x list-packages’.

  Probably introduced at or before Emacs version 29.1.

#+end_example

#+begin_src emacs-lisp
  (package-upgrade-all)
#+end_src

#+RESULTS:
| transient | prop-menu | llama | idris-mode | emacsql | cond-let |

* Text Rendering
** ansi-color

#+begin_src emacs-lisp
  (mw/describe-package 'ansi-color)
#+end_src

#+RESULTS:
#+begin_example
     Status: Built-In.
    Version: 3.4.2
    Summary: translate ANSI escape sequences into faces

This file provides a function that takes a string or a region
containing Select Graphic Rendition (SGR) control sequences (formerly
known as ANSI escape sequences) and tries to translate these into
faces.

This allows you to run ls --color=yes in shell-mode.  It is now
enabled by default; to disable it, set ansi-color-for-comint-mode
to nil.

Note that starting your shell from within Emacs might set the TERM
environment variable.  The new setting might disable the output of
SGR control sequences.  Using ls --color=yes forces ls to produce
these.

SGR control sequences are defined in section 3.8.117 of the ECMA-48
standard (identical to ISO/IEC 6429), which is freely available as a
PDF file <URL:https://www.ecma-international.org/publications/standards/Ecma-048.htm>.
The "Graphic Rendition Combination Mode (GRCM)" implemented is
"cumulative mode" as defined in section 7.2.8.  Cumulative mode
means that whenever possible, SGR control sequences are combined
(i.e. blue and bold).

The basic functions are:

`ansi-color-apply' to colorize a string containing SGR control
sequences.

`ansi-color-filter-apply' to filter SGR control sequences from a
string.

`ansi-color-apply-on-region' to colorize a region containing SGR
control sequences.

`ansi-color-filter-region' to filter SGR control sequences from a
region.

; Thanks

Georges Brun-Cottan <gbruncot@emc.com> for improving ansi-color.el
substantially by adding the code needed to cope with arbitrary chunks
of output and the filter functions.

Markus Kuhn <Markus.Kuhn@cl.cam.ac.uk> for pointing me to ECMA-48.

Stefan Monnier <foo@acm.com> for explaining obscure font-lock stuff and for
code suggestions.


#+end_example

#+begin_src emacs-lisp
  (require 'ansi-colors)
#+end_src

*** ansi-color-apply

#+begin_src emacs-lisp
  (describe-function #'ansi-color-apply)
#+end_src

#+RESULTS:
#+begin_example
ansi-color-apply is a byte-code-function in ‘ansi-color.el’.

(ansi-color-apply STRING)

Translates SGR control sequences into text properties.
Delete all other control sequences without processing them.

Applies SGR control sequences setting foreground and background colors
to STRING using text properties and returns the result.  See function
‘ansi-color-apply-sequence’ for details.

Every call to this function will set and use the buffer-local variable
‘ansi-color-context’ to save partial escape sequences and current ansi codes.
This information will be used for the next call to ‘ansi-color-apply’.
Set ‘ansi-color-context’ to nil if you don’t want this.

This function can be added to ‘comint-preoutput-filter-functions’.

  Probably introduced at or before Emacs version 21.1.

#+end_example

*** ansi-color-apply-on-region

#+begin_src emacs-lisp
  (describe-function #'ansi-color-apply-on-region)
#+end_src

#+RESULTS:
#+begin_example
ansi-color-apply-on-region is a byte-code-function in ‘ansi-color.el’.

(ansi-color-apply-on-region BEGIN END &optional PRESERVE-SEQUENCES)

Translates SGR control sequences into overlays or extents.
Delete all other control sequences without processing them.

SGR control sequences are applied by calling the function
specified by ‘ansi-color-apply-face-function’.  The default
function sets foreground and background colors to the text
between BEGIN and END, using overlays.  See function
‘ansi-color-apply-sequence’ for details.

Every call to this function will set and use the buffer-local
variable ‘ansi-color-context-region’ to save position and current
ansi codes.  This information will be used for the next call to
‘ansi-color-apply-on-region’.  Specifically, it will override
BEGIN, the start of the region and set the face with which to
start.  Set ‘ansi-color-context-region’ to nil if you don’t want
this.

If PRESERVE-SEQUENCES is t, the sequences are hidden instead of
being deleted.

#+end_example

* Editor Styling

** hl-line-mode
:PROPERTIES:
:ID:       597907CE-BFD2-4638-A46C-AD30F240B357
:END:

#+begin_src emacs-lisp
  (describe-function #'hl-line-mode)
#+end_src

#+RESULTS:
#+begin_example
hl-line-mode is an autoloaded interactive byte-code-function in
‘hl-line.el’.

(hl-line-mode &optional ARG)

Toggle highlighting of the current line (Hl-Line mode).

Hl-Line mode is a buffer-local minor mode.  If
‘hl-line-sticky-flag’ is non-nil, Hl-Line mode highlights the
line about the buffer’s point in all windows.  Caveat: the
buffer’s point might be different from the point of a
non-selected window.  Hl-Line mode uses the function
‘hl-line-highlight’ on ‘post-command-hook’ in this case.

When ‘hl-line-sticky-flag’ is nil, Hl-Line mode highlights the
line about point in the selected window only.

This is a minor mode.  If called interactively, toggle the ‘Hl-Line
mode’ mode.  If the prefix argument is positive, enable the mode, and if
it is zero or negative, disable the mode.

If called from Lisp, toggle the mode if ARG is ‘toggle’.  Enable the
mode if ARG is nil, omitted, or is a positive number.  Disable the mode
if ARG is a negative number.

To check whether the minor mode is enabled in the current buffer,
evaluate the variable ‘hl-line-mode’.

The mode’s hook is called both when the mode is enabled and when it is
disabled.

  Probably introduced at or before Emacs version 21.1.

#+end_example

* Content Styling

** auto-fill-mode
:PROPERTIES:
:ID:       7F81651F-8535-47C3-81CB-642446A3106C
:END:

#+begin_src emacs-lisp
  (describe-function #'auto-fill-mode)
#+end_src

#+RESULTS:
#+begin_example
auto-fill-mode is an interactive byte-code-function in ‘simple.el’.

(auto-fill-mode &optional ARG)

Toggle automatic line breaking (Auto Fill mode).

When Auto Fill mode is enabled, inserting a space at a column
beyond ‘current-fill-column’ automatically breaks the line at a
previous space.

When ‘auto-fill-mode’ is on, the ‘auto-fill-function’ variable is
non-nil.

The value of ‘normal-auto-fill-function’ specifies the function to use
for ‘auto-fill-function’ when turning Auto Fill mode on.

This is a minor mode.  If called interactively, toggle the ‘Auto-Fill
mode’ mode.  If the prefix argument is positive, enable the mode, and if
it is zero or negative, disable the mode.

If called from Lisp, toggle the mode if ARG is ‘toggle’.  Enable the
mode if ARG is nil, omitted, or is a positive number.  Disable the mode
if ARG is a negative number.

To check whether the minor mode is enabled in the current buffer,
evaluate the variable ‘auto-fill-function’.

The mode’s hook is called both when the mode is enabled and when it is
disabled.

  Probably introduced at or before Emacs version 19.29.

#+end_example

* Modes

** derived-mode-p

#+begin_src emacs-lisp
  (describe-function #'derived-mode-p)
#+end_src

#+RESULTS:
#+begin_example
derived-mode-p is a byte-code-function in ‘subr.el’.

(derived-mode-p MODES &rest DEPRECATED-ARGS)

Return non-nil if the current major mode is derived from one of MODES.
MODES should be a list of symbols or a single mode symbol instead of a list.
This examines the parent modes set by ‘define-derived-mode’ and also
additional ones set by ‘derived-mode-add-parents’.
We also still support the deprecated calling convention:
(derived-mode-p &rest MODES).

  Probably introduced at or before Emacs version 27.1.
  This function does not change global state, including the match data.

#+end_example


* doc-view
:PROPERTIES:
:ID:       31802476-6810-42C3-BD8D-24F0E7573563
:END:

** doc-view-mode

#+begin_src emacs-lisp
  (describe-function #'doc-view-mode)
#+end_src

#+RESULTS:
#+begin_example
doc-view-mode is an autoloaded interactive byte-code-function in
‘doc-view.el’.

(doc-view-mode)

Major mode in DocView buffers.

DocView Mode is an Emacs document viewer.  It displays PDF, PS
and DVI files (as PNG or SVG images) in Emacs buffers.

You can use C-c C-c to
toggle between displaying the document or editing it as text.

Key             Binding

RET		image-next-line
C-n		doc-view-next-line-or-next-page
C-p		doc-view-previous-line-or-previous-page
C-r		doc-view-search-backward
C-s		doc-view-search
C-t		doc-view-show-tooltip
SPC		doc-view-scroll-up-or-next-page
'		doc-view-jump-to-register
+		doc-view-enlarge
-		doc-view-shrink
0		doc-view-scale-reset
1 .. 9		digit-argument
<		beginning-of-buffer
=		doc-view-enlarge
>		end-of-buffer
?		describe-mode
F		doc-view-fit-window-to-page
H		doc-view-fit-height-to-window
K		doc-view-kill-proc
P		doc-view-fit-page-to-window
W		doc-view-fit-width-to-window
b		image-previous-frame
f		image-next-frame
g		revert-buffer
h		describe-mode
k		image-kill-buffer
m		doc-view-page-to-register
n		doc-view-next-page
p		doc-view-previous-page
q		quit-window
r		revert-buffer
u		image-mode-unmark-file
w		image-mode-copy-file-name-as-kill
DEL		doc-view-scroll-down-or-previous-page
S-SPC		doc-view-scroll-down-or-previous-page
C-<mouse-4>	image-mouse-increase-size
C-<mouse-5>	image-mouse-decrease-size
C-<wheel-down>	image-mouse-decrease-size
C-<wheel-up>	image-mouse-increase-size
<down>		doc-view-next-line-or-next-page
<find>		doc-view-search
<next>		forward-page
<prior>		backward-page
<up>		doc-view-previous-line-or-previous-page

C-c C-c		doc-view-toggle-display
C-c C-t		doc-view-open-text

c b		doc-view-set-slice-from-bounding-box
c h		doc-view-center-page-horizontally
c m		doc-view-set-slice-using-mouse
c r		doc-view-reset-slice
c s		doc-view-set-slice
c v		doc-view-center-page-vertically

M-<		doc-view-first-page
M->		doc-view-last-page

<remap> <backward-page>		doc-view-previous-page
<remap> <forward-page>		doc-view-next-page
<remap> <goto-line>		doc-view-goto-page
<remap> <text-scale-adjust>	doc-view-scale-adjust

<remap> <backward-char>		 image-backward-hscroll
<remap> <beginning-of-buffer>	 image-bob
<remap> <end-of-buffer>		 image-eob
<remap> <forward-char>		 image-forward-hscroll
<remap> <left-char>		 image-backward-hscroll
<remap> <move-beginning-of-line> image-bol
<remap> <move-end-of-line>	 image-eol
<remap> <next-line>		 image-next-line
<remap> <previous-line>		 image-previous-line
<remap> <right-char>		 image-forward-hscroll
<remap> <scroll-down>		 image-scroll-down
<remap> <scroll-down-command>	 image-scroll-down
<remap> <scroll-left>		 image-scroll-left
<remap> <scroll-right>		 image-scroll-right
<remap> <scroll-up>		 image-scroll-up
<remap> <scroll-up-command>	 image-scroll-up

a +		image-increase-speed
a -		image-decrease-speed
a 0		image-reset-speed
a r		image-reverse-speed

s 0		image-transform-reset-to-initial
s b		image-transform-fit-both
s f		image-mode-fit-frame
s h		image-transform-fit-to-height
s i		image-transform-fit-to-width
s m		image-transform-set-smoothing
s o		image-transform-reset-to-original
s p		image-transform-set-percent
s r		image-transform-set-rotation
s s		image-transform-set-scale
s w		image-transform-fit-to-window

C-c C-c		image-toggle-display
  (this binding is currently shadowed)
C-c C-x		image-toggle-hex-display

i h		image-flip-horizontally
i r		image-rotate
i v		image-flip-vertically

i +		image-increase-size
i -		image-decrease-size
i c		image-crop
i o		image-save
i x		image-cut

  Probably introduced at or before Emacs version 28.1.

#+end_example
** doc-view-ghostscript-program

#+begin_src emacs-lisp
  (describe-variable 'doc-view-ghostscript-program)
#+end_src

#+RESULTS:
#+begin_example
doc-view-ghostscript-program is a variable defined in ‘doc-view.el’.

Its value is "gs"

Program to convert PS and PDF files to PNG.

  This variable may be risky if used as a file-local variable.
  This variable was introduced, or its default value was changed, in
  version 27.1 of Emacs.
  You can customize this variable.

#+end_example

* XWidgets

** xwidget-webkit-browse-url

#+begin_src emacs-lisp
  (describe-function #'xwidget-webkit-browse-url)
#+end_src

#+RESULTS:
#+begin_example
xwidget-webkit-browse-url is an autoloaded interactive
byte-code-function in ‘xwidget.el’.

(xwidget-webkit-browse-url URL &optional NEW-SESSION)

Ask xwidget-webkit to browse URL.
NEW-SESSION specifies whether to create a new xwidget-webkit session.
Interactively, URL defaults to the string looking like a url around point.

  Probably introduced at or before Emacs version 25.1.

#+end_example

** mw/xw/new-search

Open a new xwidget window searching for the provided term
using [[id:2140D11D-1066-4B77-9062-0B8A1C5A287D][url-encode-url]].

#+begin_src emacs-lisp
  (defun mw/xw/new-search (q)
    (xwidget-webkit-browse-url (url-encode-url (format "https://www.duckduckgo.com?q=%s" q))))
#+end_src

#+RESULTS:
: mw/xw/new-search

* Sharing macOS Environment Variables with Emacs
:PROPERTIES:
:ID:       4F46C5C5-5999-4BCD-8432-2AE564B64843
:END:

This information is I think captured in a square, which I'll better
integrate later.

For emacs I typically want to reuse the same environment variables
defined for the shell, but that is non-trivial in
[[id:516B3C9A-4288-4ACF-8DEE-3526DFD21083][macOS]]. exec-path-from-shell is a perfectly good approach but feels
like it /shouldn't/ be needed - Emacs-plus provides an arguably
cleaner alternative but is applied at the time of installation and
therefore may miss some changes (which could be addressed by a
re-install).

Experiments to handle this through the applications ~plist~ fell flat,
so what I've ended up doing is injecting an additional script within
the applicaion bundle to act as the entrypoint, which uses a shell to
load a shared environment prior to ~exec~ing the main emacs process.

An invokable recipe should be pulled in here later.

** TODO Reimplement this
